import type { Metadata } from 'next'
import React from 'react'

export const metadata: Metadata = {
    title: 'Политика за Поверителност | Промяна AI',
    description: 'Научете за нашите мерки за защита на личните данни на Промяна AI. Разгледайте как обработваме и защитаваме вашата лична информация, когато използвате нашия сайт за статии и информация от света на технологиите и изкуствения интелект.',
    keywords: 'защита на лични данни, поверителност в интернет, лична информация, сигурност на данни, обработка на лични данни, уебсайт за технологии, изкуствен интелект и поверителност',
    alternates: {
        canonical: `https://promiana-ai.com/privacy-policy`,
    },
    openGraph: {
        images: `https://www.promiana-ai.com/opengraph-image.png`,
    }
}

function PrivacyPolicy() {
    return (
        <div className='bg-white p-10'>
            <h1 className='text-2xl font-bold'>Политика за Поверителност на Промяна AI</h1>
            <br />
            <p><strong>1. Въведение</strong><br />
                Ние в Промяна AI разбираме, че поверителността на вашата лична информация е важна. Тази политика обхваща видовете лична информация, която получаваме и събираме, когато използвате Промяна AI, както и някои от стъпките, които предприемаме за защита на информацията.</p>
            <br />
            <p><strong>2. Събиране на лични данни</strong><br />
                - <strong>2.1. Лични данни, които събираме:</strong> Можем да събираме лични данни като IP адреси, типа на браузъра, времето на посещение, референтни страници и друга подобна информация.<br />
                - <strong>2.2. Цел на събирането:</strong> Събирането на тези данни се използва за подобряване на съдържанието на нашия уебсайт, за проследяване на злоупотреби и за обезпечаване на сигурността на сайта.</p>
            <br />
            <p><strong>3. Използване на информацията</strong><br />
                Информацията, събрана от Промяна AI, ще се използва само в съответствие с целите, за които е събрана. Ние не продаваме, споделяме или отдаваме тази информация на трети страни, освен в случаите, предвидени от закона.</p>
            <br />
            <p><strong>4. Защита на личните данни</strong><br />
                Предприемаме разнообразни мерки за защита на вашата лична информация. Въпреки това, тъй като нито един метод на предаване на информация в интернет, или метод на електронно съхранение не е напълно сигурен, ние не можем да гарантираме абсолютната сигурност на информацията.</p>
            <br />
            <p><strong>5. Вашите права</strong><br />
                Имате право да поискате достъп до личните си данни, които обработваме, да поискате тяхното коригиране или изтриване, или да възразите срещу тяхната обработка.</p>
            <br />
            <p><strong>6. Промени в Политиката за Поверителност</strong><br />
                Промяна AI си запазва правото да прави промени в тази Политика за Поверителност по всяко време. Потребителите трябва редовно да проверяват тази страница за евентуални промени.</p>
            <br />
            <p><strong>7. Контакт</strong><br />
                Ако имате въпроси относно тази политика за поверителност или обработката на вашите лични данни, моля, свържете се с нас на <a href='mailto:info@promiana-ai.com'>info@promiana-ai.com</a>.</p>
        </div>
    )
}

export default PrivacyPolicy