import type { Metadata } from 'next'
import React from 'react'

export const metadata: Metadata = {
    title: 'Условия за Ползване | Промяна AI',
    description: 'Прочетете условията за ползване на Промяна AI, където можете да качвате и четете статии в областта на технологиите и изкуствения интелект без регистрация. Разберете повече за вашите права и отговорности като потребител на нашия сайт.',
    keywords: 'условия за ползване, права на потребителите, отговорност при публикуване, ползване на технологичен уебсайт, правила за публикуване, безопасност и сигурност в интернет, изкуствен интелект',
    alternates: {
        canonical: `https://promiana-ai.com/terms-of-use`,
    },
    openGraph: {
        images: `https://www.promiana-ai.com/opengraph-image.png`,
    }
}


function TermsOfUse() {
    return (
        <div className='bg-white p-10'>
            <h1 className='text-2xl font-bold'>Условия за Ползване на Промяна AI</h1>
            <br />
            <p><strong>1. Въведение</strong><br />
                Добре дошли в Промяна AI. Тези условия за ползване регулират вашето използване на нашия уебсайт; като използвате нашия уебсайт, вие приемате тези условия за ползване в пълна степен. Ако не сте съгласни с тези условия или с някоя част от тези условия, не трябва да използвате нашия уебсайт.</p>
            <br />
            <p><strong>2. Авторски права</strong><br />
                Съдържанието, публикувано на уебсайта, е защитено с авторски права и принадлежи на съответните автори или на Промяна AI. Неоторизираното копиране, разпространение, модификация или публикуване на каквото и да е съдържание от сайта е строго забранено.</p>
            <br />
            <p><strong>3. Отговорност на потребителите</strong><br />
                Потребителите могат да публикуват статии без необходимост от регистрация. Всеки потребител носи пълна отговорност за съдържанието, което публикува. Забранено е публикуването на обидно, клеветническо, порнографско, насърчително към омраза или насилие, или каквото и да е незаконно съдържание.</p>
            <br />
            <p><strong>4. Събиране и използване на лични данни</strong><br />
                Промяна AI може да събира лични данни, като IP адреси, за целите на предотвратяване на злоупотреби и подобряване на услугите. Всяко събиране и обработка на лични данни ще се извършва в съответствие с приложимото законодателство за защита на данните.</p>
            <br />
            <p><strong>5. Ограничение на отговорността</strong><br />
                Промяна AI не носи отговорност за точността, законността или надеждността на съдържанието, публикувано от потребителите.</p>
            <br />
            <p><strong>6. Право на изменение на условията</strong><br />
                Промяна AI си запазва правото да променя тези условия за ползване по всяко време. Потребителите са отговорни за редовното проверяване на тези условия.</p>
            <br />
            <p><strong>7. Юрисдикция и приложимо право</strong><br />
                Тези условия ще бъдат управлявани от и тълкувани в съответствие с законите на Република България</p>
        </div>
    )
}

export default TermsOfUse