import type { Metadata } from 'next'
import React from 'react'

export const metadata: Metadata = {
    title: 'Политика за Бисквитки | Промяна AI',
    description: 'Разберете как използваме бисквитки на Промяна AI за подобряване на вашето изживяване на нашия уебсайт. Прочетете за различните видове бисквитки, които използваме, и как можете да управлявате вашите настройки за поверителност.',
    keywords: 'бисквитки, уебсайт бисквитки, управление на бисквитки, аналитични бисквитки, функционални бисквитки, маркетингови бисквитки, поверителност на браузъра, настройки за поверителност',
    alternates: {
        canonical: `https://promiana-ai.com/cookies-policy`,
    },
}

function CookiesPolicy() {
    return (
        <div className='bg-white p-10'>
            <h1 className='text-2xl font-bold'>Политика за Бисквитки на Промяна AI</h1>
            <br />
            <p><strong>1. За Бисквитките</strong><br />
                Бисквитките са малки текстови файлове, които уебсайтовете могат да използват, за да направят потребителското изживяване по-ефективно. Законът изисква, че можем да съхраняваме бисквитки на вашето устройство, ако те са строго необходими за работата на този сайт. За всички други видове бисквитки се нуждаем от вашето разрешение.</p>
            <br />
            <p><strong>2. Използване на Бисквитки</strong><br />
                <strong>2.1. Необходими Бисквитки:</strong> Тези бисквитки са необходими за функционирането на уебсайта и не могат да бъдат изключени в нашите системи. Обикновено се задават само в отговор на действия, извършени от вас, които съответстват на заявка за услуги, като например настройка на вашите предпочитания за поверителност, влизане или попълване на формуляри.<br />
                <strong>2.2. Аналитични Бисквитки:</strong> Тези бисквитки ни помагат да разберем как посетителите взаимодействат с уебсайта, като анонимно събират и съобщават информация.<br />
                <strong>2.3. Функционални Бисквитки:</strong> Тези бисквитки подобряват функционалността и персонализацията на сайта.<br />
                <strong>2.4. Маркетингови Бисквитки:</strong> Тези бисквитки могат да бъдат зададени чрез нашия сайт от нашите рекламни партньори. Те могат да се използват от тези компании, за да изградят профил на вашите интереси и да ви показват релевантни реклами на други сайтове.</p>
            <br />
            <p><strong>3. Управление на Бисквитките</strong><br />
                Имате възможност да управлявате и/или изтривате бисквитките, както пожелаете. Можете да изтриете всички бисквитки, които вече са на вашето устройство, и можете да настроите повечето браузъри да ги блокират. Ако направите това, обаче, може да се наложи ръчно да настройвате някои предпочитания всеки път, когато посетите сайта, и някои услуги и функционалности може да не работят.</p>
            <br />
            <p><strong>4. Вашите Права</strong><br />
                Имате право на контрол върху вашата лична информация. Можете да поискате достъп до личните си данни, които обработваме, да поискате тяхното коригиране или изтриване, или да възразите срещу тяхната обработка.</p>
            <br />
            <p><strong>5. Промени в Политиката за Бисквитки</strong><br />
                Промяна AI си запазва правото да прави промени в тази Политика за Бисквитки по всяко време. Потребителите трябва редовно да проверяват тази страница за евентуални промени.</p>
        </div>
    )
}

export default CookiesPolicy